[
  {
    "post_title": "Brunch",
    "title": "brunch",
    "preview": "## Brunch\n\n\nI enter the brunch shop. I am with my fiancé, for our weekly treat. Today we want to sit inside. This is atypical. Usually we sit outside, under the red umbrellas that filter light and tin...",
    "url": "writing/stories_brunch",
    "imageSources": [
      "/writing/images/brunch.png"
    ],
    "scripts": [],
    "image": "/writing/images/brunch.png",
    "content": "## Brunch\n\n\nI enter the brunch shop. I am with my fiancé, for our weekly treat. Today we want to sit inside. This is atypical. Usually we sit outside, under the red umbrellas that filter light and tint the experience. But today it is hot. Not the typical hot of summer, but the atypical kind. That of somewhere very hot. Or perhaps it’s simply typical for it to be atypically hot. In either case, today we want to sit inside. So when the waitress greets us and guides us to our seat, it’s a pleasant air-conditioned seat. And when we sit down, the seat has a cushion, and a back. A truly pleasant back on the seat, padded and wrapped in a light brown faux leather. The waitress asks what we will be drinking. A coffee for me. Just water today for my fiancé. I glance at my menu, although I am already certain of what I will be ordering: a breakfast burrito with sausage. The fiancé wanders more. She looks over the menu. Evaluating her options. Neither of us is hungry. We question why we went to brunch when we are not hungry. The answer is in the hot coffee now arriving. In the pages of the book resting on the table. We remember why we went to brunch. So we order a burrito to share. A breakfast burrito with sausage. A conversation sparks up. We discuss people and meaning. I say something about what I am reading. She says something about what I am reading. The burrito arrives, cut in two, divided equally onto two plates. She has the larger half. I pluck her half of the burrito from her plate, and swap it with my own – theft for the hungrier. The waitress brings Cholula sauce and departs once more.  We discuss her class, and ideas. I present an opinion. The coffee empties and is refilled. She tells me about another idea. I have no opinion. I finish my half of the burrito, and she finishes a quarter of the burrito. Unable to eat more, she plucks half of her half of the burrito and plops the remains onto my plate. I notice an orange slice on the plate now. I had been transfixed by the burrito, but now the orange slice is the original resident of the plate, and the burrito is the invader. Yet the burrito was originally sawed in half, and plucked from this plate to be replaced by a larger half. And before that it was a whole burrito plucked and plopped onto two plates. I get lost in what defines a burrito, and open my book. She tells me more about her school, but I’m reading now and my answers are non-committal. The world flows away, and the ink blots out my visions until I swim in the ponderings of thinkers past. More coffee? Please, and thank you. And the coffee is refilled and I continue reading. I consider an assignment. To replicate the style of authors. This interests her. I suggest a few names. These do not interest her. She suggests a few names. These do not interest me. She says I should include a woman. I ask why. She says it would be interesting. I ask why. She says the contrast. I agree because it does make sense. I look down at the pages. Written by a man. I consider the style of men. How we replicate that style, learn from it, and shape our thoughts. The words we think are of men. And it troubles me. I keep the comment to myself. She tells me about sex positivity and argues that women slut shame more than men. It seems nonsensical, but perhaps. I ask her to elaborate because there are so many examples of men suppressing women. This country is not sex-positive. I ask relative to what. Europe. I find it interesting and wander a bit with her. I tease out the truth in that. That turtle hides deep within a shell, so I leave it be. Often the head only pokes out when it is unchallenged. I drain my coffee. Reject a refill, cram the final bite of the burrito into my mouth, and we depart.\n\n\n![orange on plate](/writing/images/brunch.png)"
  },
  {
    "post_title": "Inflate and Desaturate",
    "title": "0_Inflate_and_desaturate",
    "preview": "<div align=\"center\">\n\n## Inflate and Desaturate\n\nMuch of the time, when I look at art, it leaves me deeply depressed. \nI see colors and they make me sad. When on a walk, I pause,\nto glance up at the s...",
    "url": "writing/poems_0_Inflate_and_desaturate",
    "imageSources": [
      "/writing/images/inflate.png"
    ],
    "scripts": [],
    "image": "/writing/images/inflate.png",
    "content": "<div align=\"center\">\n\n## Inflate and Desaturate\n\nMuch of the time, when I look at art, it leaves me deeply depressed. \nI see colors and they make me sad. When on a walk, I pause,\nto glance up at the sky, in pastels and desaturated hues, tucking\nthe brilliant golden hills into sleep. The woodpeckers like\nchildren frolic in the sky, “ashes ashes we all fall down.”\n\nI’m forced to cry when the purple Martins swoop down as if they are\nshackled too. As we all are. I think of how cruel it is that the\ncrow breathes the air I exhale, and we cycle together under the moon, \nBut the sparrows soar, picked up by the current, lifted by the wind\nand I laugh in delight at their beauty which is so playful.\n\nAnd that is my condition, where color saturates and desaturates. \nAnd I am a deflated balloon whose helium escapes the mylar,\nbut could be refilled if given the chance. So fragile, nonetheless,\nas the more I am inflated, the thinner my skin, inflated until\nit would take just the kiss of a knife for me to pop.\n\n\n![inflate](/writing/images/inflate.png)"
  },
  {
    "post_title": "ABC",
    "title": "ABC",
    "preview": "## ABC\n\nDate: 11-30-2023\n\nAdam awakens, ancestral Angel,\nAmber ambrosia, apples abound, \nAphrodite's allure, astonishing.\n\n\nBeautiful baby born believing.\nBrave beneath blue blankets,\nBastard becomes ...",
    "url": "writing/poems_ABC",
    "imageSources": [
      "https://workers-ai.eankrenzin.workers.dev/?key=image-1701334876420.png"
    ],
    "scripts": [],
    "image": "https://workers-ai.eankrenzin.workers.dev/?key=image-1701334876420.png",
    "content": "## ABC\n\nDate: 11-30-2023\n\nAdam awakens, ancestral Angel,\nAmber ambrosia, apples abound, \nAphrodite's allure, astonishing.\n\n\nBeautiful baby born believing.\nBrave beneath blue blankets,\nBastard becomes being.\n\n\nColosseum crumbles, civilizations change.\nCycles continue, ceaselessly compelling\nCunning, courageous, characters.\n\n\nDelaying death, defying doom,\nDaring deeds, defining destiny  \nDusk dawns, dreamscape.\n\n![image](https://workers-ai.eankrenzin.workers.dev/?key=image-1701334876420.png)"
  },
  {
    "post_title": "Bags under my eyes",
    "title": "Bags_tired",
    "preview": "<div align=\"center\">\n\n## Bags under my eyes\n\nThere are bags under my eyes, big\nDark splotches of purple on leathery skin.\nThey are sunken-in like when you scoop powder and it leaves an imprint.\nI feel...",
    "url": "writing/poems_Bags_tired",
    "imageSources": [
      "/writing/images/bags_eyes.png"
    ],
    "scripts": [],
    "image": "/writing/images/bags_eyes.png",
    "content": "<div align=\"center\">\n\n## Bags under my eyes\n\nThere are bags under my eyes, big\nDark splotches of purple on leathery skin.\nThey are sunken-in like when you scoop powder and it leaves an imprint.\nI feel my face shake when I step, my sinuses hollow.\nIt is as if my jaw is sliding around in there,\nThe muscle rotting away leaving only bone.\nI can hear my face rattle, and the sounds are gray.\n\nI remember a poem so beautiful, but it’s gone.\nSo much is gone. It is as though I cannot remember anymore.\nPerhaps all there is to remember is the feeling of tiredness.\n\nClouds are so beautiful until the sky is gray. Then I miss the blues.\n\n![bags_tired](/writing/images/bags_eyes.png)\n"
  },
  {
    "post_title": "Blank",
    "title": "Blank",
    "preview": "<div align=\"center\">\n\n## Blank\n\nI should write, but my mind is Blank. \nLike De-Ja-Vu and this Feeling \nis of Russian dolls, Matryoshka \nof all turtles, All the way down, \nA sideways eight, infinitely....",
    "url": "writing/poems_Blank",
    "imageSources": [
      "https://workers-ai.eankrenzin.workers.dev/?key=image-1702229911693.png"
    ],
    "scripts": [],
    "image": "https://workers-ai.eankrenzin.workers.dev/?key=image-1702229911693.png",
    "content": "<div align=\"center\">\n\n## Blank\n\nI should write, but my mind is Blank. \nLike De-Ja-Vu and this Feeling \nis of Russian dolls, Matryoshka \nof all turtles, All the way down, \nA sideways eight, infinitely. \n\n![blank](https://workers-ai.eankrenzin.workers.dev/?key=image-1702229911693.png)"
  },
  {
    "post_title": "Bookshop Idea",
    "title": "BookShop",
    "preview": "<div align=\"center\">\n\n## Bookshop Idea\n\nI must here, in the entrance, beg pardon of my reader for the frequent use of the word Idea,\nwhich he will find in the following treatise. \nIt being that term w...",
    "url": "writing/poems_BookShop",
    "imageSources": [
      "/writing/images/bookshop.png"
    ],
    "scripts": [],
    "image": "/writing/images/bookshop.png",
    "content": "<div align=\"center\">\n\n## Bookshop Idea\n\nI must here, in the entrance, beg pardon of my reader for the frequent use of the word Idea,\nwhich he will find in the following treatise. \nIt being that term which serves best to stand \nfor the understanding, when a man thinks.\n\nDo you ever stride in a used book shop,\nSide to side, down each aisle, for future bride,\nSeeking where the perfect book might hide,\nBack and forth you glide, unable to stop?\n\nTurning paper, searching for pencil marks\nOf past. Earned lines which muddy the words \nwith insight, far mightier than shinning swords,\nIn spite of peaceful minds and hearts.\n\nDo you love the smell of the pages,\nWhich is ancient like the Acropolis,\nStill standing tall against the metropolis\nWhen you open Plato’s Phaedrus.\n\nDiving deep into irony and metonym\n\n\n![bookshop](/writing/images/bookshop.png)"
  },
  {
    "post_title": "By the Drum",
    "title": "By_the_drum",
    "preview": "<div align=\"center\">\n    \n\n## By the Drum\n\nMountain to drum, to blue sky, the sun shines bright,\nSun shines, glitters like gold, over the fields so wide,\nBy the dam, by the dam, by the dam, by the dam...",
    "url": "writing/poems_By_the_drum",
    "imageSources": [
      "/writing/images/cottage_drum.png"
    ],
    "scripts": [],
    "image": "/writing/images/cottage_drum.png",
    "content": "<div align=\"center\">\n    \n\n## By the Drum\n\nMountain to drum, to blue sky, the sun shines bright,\nSun shines, glitters like gold, over the fields so wide,\nBy the dam, by the dam, by the dam, by the dam,\nBy the sea, by the sea, yes, yes, yes, sing so, sing sing,\nLook at me. Ooh air goes on, goes on with the wind,\nWhere, where to be, where to be, where will you be, where to stay,\nLittle cottage, flowers smell sweet, cottage, are you free, little cottage?\n\n\n![cotatge](/writing/images/cottage_drum.png)"
  },
  {
    "post_title": "Doki Doki",
    "title": "Doki_Doki",
    "preview": "\n<div align=\"center\">\n\n\n\n## Doki Doki\n\n心 どきどき (Heart pounding)\n痛 どきどき (Pain throbbing)\nSweet moments fleeting,\nBitter memories, yet endearing.\n愛 dance with pastel and ink.\n\n\n...",
    "url": "writing/poems_Doki_Doki",
    "imageSources": [
      "/writing/images/doki_doki.png"
    ],
    "scripts": [],
    "image": "/writing/images/doki_doki.png",
    "content": "\n<div align=\"center\">\n\n\n\n## Doki Doki\n\n心 どきどき (Heart pounding)\n痛 どきどき (Pain throbbing)\nSweet moments fleeting,\nBitter memories, yet endearing.\n愛 dance with pastel and ink.\n\n\n![doki doki](/writing/images/doki_doki.png)"
  },
  {
    "post_title": "Reluctant Recluse",
    "title": "I_shut_my_doors",
    "preview": "## Reluctant Recluse\n\nI shut my doors, threw the key out to sea.\nI decree to all: I refuse to see!\nYet still they come in flocks, like birds, to me,\nexpecting eyes and ears complete and free.\n\nNow pea...",
    "url": "writing/poems_I_shut_my_doors",
    "imageSources": [
      "https://workers-ai.eankrenzin.workers.dev/?key=image-1702491389997.png"
    ],
    "scripts": [],
    "image": "https://workers-ai.eankrenzin.workers.dev/?key=image-1702491389997.png",
    "content": "## Reluctant Recluse\n\nI shut my doors, threw the key out to sea.\nI decree to all: I refuse to see!\nYet still they come in flocks, like birds, to me,\nexpecting eyes and ears complete and free.\n\nNow peace, that which I have so tantalized,\nFinally a moment, I fantasized,\nbreath of air! The quiet of just me! To\nwake from soft morning breeze across the dew.\n\nopen windows to the night; to the coo\nOf doves, generations, not of few,\nAh their kisses, and love, how sweet they hum,\nBefore: “BOOM” a knock at the door, a drum.\n\n“Just a lone moment please. Sign here in pen\ngood sir, I will leave you forever then.”\n“One moment? Strange indeed for you inquire,\nOne moment is that I too do desire.”\n\nI open to see them in full and stark,\nthe sight is of a talking bird: a stork!\nHow mighty is this bird whose massive beak\ncarries within gentle babe wrapped in sheet.\n\nI gasp in awe, at the sight from his maw\na shock to my system I cannot draw\nair and the thought of this new mouth to feed\nWhence I had so very nearly been freed.\n\nI cry and decree: \"T'is a lie good stork\nThis cannot be true, I am not of sport,\nMy shots are not straight, completely askew,\nWhy must you come to establish a zoo?\"\n\n\"Well good sir, at least one of your targets\nwas struck by cupids arrow, and carpets\nhave been laid down for you to walk the aisle\nAvoid as you may, this may take a while.\"\n\n\"I shut my doors and thew away the key,\nI decreed to all: I refuse to see!\"\nThe stork chuckles and says, \"Indeed and yet\nhere we are.” Then. “Would you be an outlet?”\n\n“I will share my story in all glory\nIf you aren’t in too much of hurry.”\nThe stork cocked it big head in confusion.\n“Dear human, is clearly in delusion.”\n\n“I am a stork, not your doctor. Sir Please,\nSign with pen so I can return to breeze.”\nWith gusto, the stork thrust a pad into\nmy hands, and said “I would like to go soon.”\n\nAnd I look down to where a midnight pen\nHas appeared in hand where air had just been\nI sigh, and sign for, it can’t be denied\nThis is mine, a beautiful sight inside\n\nIn those satin sheets, milky white, all mine\nOf warmth. That is mine. That is mine I sign.\nThe Stork passes the babe, wrapped in sheet, And\nturns around, leaping from ground with his feet.\n\n“Oh dear. Dear oh dear. What am I to do?\nI have signed on pad, and said it is true.\nYou are mine and I am yours, your father,\nOh, just when I deemed to not be bothered”\n\nI call out to house, for a new member\nJoined our ranks in the month of November.\n“I have news to share.” “You do?” “Yes in fact.”\nMy love looks to me, and our dog and cat.\n\n“We have given birth, and you will mother.”\n“Oh joyous! I have waited forever!”\nAnd she leaps and soars to embrace me now,\nAs too our dog barks loud and shy cat meows.\n\n\n\n\n\n\n\n\n\n![cover](https://workers-ai.eankrenzin.workers.dev/?key=image-1702491389997.png)"
  },
  {
    "post_title": "Left Behind",
    "title": "Left_behind",
    "preview": "## Left Behind\n\n2023-12-8\n\nI am forgotten because I chose not to remember. It pains me when someone asks if I remember an experience, for I never do. Instead I remember the other who was self then. My...",
    "url": "writing/poems_Left_behind",
    "imageSources": [
      "https://workers-ai.eankrenzin.workers.dev/?key=image-1701980561293.png"
    ],
    "scripts": [],
    "image": "https://workers-ai.eankrenzin.workers.dev/?key=image-1701980561293.png",
    "content": "## Left Behind\n\n2023-12-8\n\nI am forgotten because I chose not to remember. It pains me when someone asks if I remember an experience, for I never do. Instead I remember the other who was self then. My history is lost, only the other who observed it remains. I hope that he will surface from the deep abyss, erupting from the waves as a whale does. Perhaps in death, if only to say goodbye. How deeply I miss them all.\n\n  \nIn forgotten realms, I chose not to dwell,  \nFor memories' pain, in depths they well.  \nQueries of past, bring a silent toll,  \nI recall not the experience, but the soul.\n\nThe self that was, now shadows cast,  \nA history lost, in time's vast.  \nObserver remains, the other within,  \nHoping for emergence, where depths begin.\n\nFrom abyssal echoes, a wish to arise,  \nLike whales breaching, under open skies.  \nIn death's embrace, a final plea,  \nTo greet once more, the selves that flee.\n\nOh, how I yearn for those gone by,  \nIn memories' absence, I silently sigh.  \nEach forgotten moment, a vanishing trace,  \nOf the other who lived, in this temporal space.\n\n![Left Behind](https://workers-ai.eankrenzin.workers.dev/?key=image-1701980561293.png)"
  },
  {
    "post_title": "Moon above Lagoon and Lune",
    "title": "Moon_above_lagoon",
    "preview": "\n<div align=\"center\">\n\n## Moon above Lagoon and Lune\n\nIn all my life \nI desired for Dignity.\nI have believed it to be\nSomething achieved,\nIt’s not earned.\n\nFrom a young age, I have been a contrarian. ...",
    "url": "writing/poems_Moon_above_lagoon",
    "imageSources": [
      "/writing/images/moon.png"
    ],
    "scripts": [],
    "image": "/writing/images/moon.png",
    "content": "\n<div align=\"center\">\n\n## Moon above Lagoon and Lune\n\nIn all my life \nI desired for Dignity.\nI have believed it to be\nSomething achieved,\nIt’s not earned.\n\nFrom a young age, I have been a contrarian. I catch myself arguing for the sake of argument. I derive no pleasure in this compulsion, yet I am the moon, not la lune. Perhaps it is from English I cycle, or perhaps my passion is an observation of the stars, that ambition to exist as more than a clever being on a speck of space dust. However, Argument inevitably guides us to isolation. Whatever the reason, today, I envy la lune, and her serene reflection against the waves. A reflection will always have a companion in her mirror. \n\nM\nO          O\nN\n\n~ ~ ~ ~ ~ ~\n~ ~ ~ E ~ ~ ~\n~ ~ N ~ ~ U ~ ~\n~ ~ ~ L ~ ~ ~\n~ ~ ~ ~ ~ ~\n\n\n\n![moon](/writing/images/moon.png)"
  },
  {
    "post_title": "A New Day, A New Essence",
    "title": "New_day_new_existence",
    "preview": "## A New Day, A New Essence\n \n2023-12-07\n\nA new day, a new existence - the dreams we have are death,\nIn the silent theater of night, they draw their final breath.\nStimuli intense to the point of vapor...",
    "url": "writing/poems_New_day_new_existence",
    "imageSources": [
      "https://workers-ai.eankrenzin.workers.dev/?key=image-1701975481920.png"
    ],
    "scripts": [],
    "image": "https://workers-ai.eankrenzin.workers.dev/?key=image-1701975481920.png",
    "content": "## A New Day, A New Essence\n \n2023-12-07\n\nA new day, a new existence - the dreams we have are death,\nIn the silent theater of night, they draw their final breath.\nStimuli intense to the point of vaporization,\nEvery dawn's light, a phoenix's reincarnation.\n\nOne cannot help but mourn the one who has fallen,\nThe self that was, in yesterday's shadows, now sunken.\nStay awake, and live a bit longer in this transient play,\nFor inevitably, under the moon's gaze, we all fray.\n\nIn the dance of light and dark, we are but fleeting sparks,\nEphemeral flames, extinguished in the cosmic arcs.\nEach moment, a goodbye to the self that once soared,\nIn the relentless march of time, perpetually ignored.\n\nSo, embrace the dawn, with its promise of rebirth,\nA chance to redefine, to unearth a new worth.\nBut remember, as stars twinkle in the endless night,\nSleep will come, ending the struggle, the fight.\n\n![image](https://workers-ai.eankrenzin.workers.dev/?key=image-1701975481920.png)"
  },
  {
    "post_title": "Saturation",
    "title": "Saturation",
    "preview": "<div align=\"center\">\n\n## Saturation\n\nI arose today and unveiled the shroud,\nI pulled the cord to remove the cloud\nthat yields light to wax and wane. \nThe warden of a window. Stain\nof gray. Once gated,...",
    "url": "writing/poems_Saturation",
    "imageSources": [
      "/writing/images/saturation.png"
    ],
    "scripts": [],
    "image": "/writing/images/saturation.png",
    "content": "<div align=\"center\">\n\n## Saturation\n\nI arose today and unveiled the shroud,\nI pulled the cord to remove the cloud\nthat yields light to wax and wane. \nThe warden of a window. Stain\nof gray. Once gated,\nchange has been fated.\n\nToday the breeze blows away the storm,\nand my window rests open, not forlorn.\nI decree: Please come and see thee!\nAnd pray, who does still remember me?\n\nAnd come they do, through\nmy window. Colors, though few,\nNever again will I bid Adieu!\n\nThose beautiful yellows, how could I\nhave forgotten you Yellow, but inside\nmy castle is made of rocks: completely gray.\nBut now you are here, so Yellow, please stay.\nWe can dance, and sing and frolic and play,\nYellow, my friend. Please do not go again.\n\nAnd Blue, my handsome man, so loud\nare your hues as you zoom past that cloud,\nI am so grateful for you, too, Blue.\nYou always bring about something new\nin the sky which you saturate,\nI must say, you do infatuate.\n\nBut oh my, Red. What else can be said,\nhow gorgeous are the fabrics you bed,\noh Red, in love your light fills my head,\nand I covet you so, so joyous is thy face\nfingertips, and arms that you embrace\nme with. Oh Red, never again leave my place.\n\n\n![saturation](/writing/images/saturation.png)"
  },
  {
    "post_title": "Scarecrow",
    "title": "Scarecrow",
    "preview": "## Scarecrow\n\nA poem that is convoluted, ironic in that it cannot be refuted,\nFor the nature of obscurity, rather than maturity, is a scarecrow.\n\n\n\n...",
    "url": "writing/poems_Scarecrow",
    "imageSources": [
      "https://workers-ai.eankrenzin.workers.dev/?key=image-1702231124782.png"
    ],
    "scripts": [],
    "image": "https://workers-ai.eankrenzin.workers.dev/?key=image-1702231124782.png",
    "content": "## Scarecrow\n\nA poem that is convoluted, ironic in that it cannot be refuted,\nFor the nature of obscurity, rather than maturity, is a scarecrow.\n\n\n\n![scarecrow](https://workers-ai.eankrenzin.workers.dev/?key=image-1702231124782.png)"
  },
  {
    "post_title": "Second-hand Smoke",
    "title": "Secondhand_Smoke",
    "preview": "<div align=\"center\">\n\n## Second-hand Smoke\n\nIn the heart of the verdant field I recline, a palette of nature’s songbirds chime,\nWoodpeckers knock the morning bell, owls hoot mourning tales of mice the...",
    "url": "writing/poems_Secondhand_Smoke",
    "imageSources": [
      "/writing/images/second_smoke.png"
    ],
    "scripts": [],
    "image": "/writing/images/second_smoke.png",
    "content": "<div align=\"center\">\n\n## Second-hand Smoke\n\nIn the heart of the verdant field I recline, a palette of nature’s songbirds chime,\nWoodpeckers knock the morning bell, owls hoot mourning tales of mice they kill.\nThe dew-kissed grasses sway in the breeze, the chorus of frogs echo through the trees,\nWith lighter in hand and pipe pressed to lips, I embark on this nature's trip.\n\nThe flint sparks alive with a dancer's grace, casting flickers across my face,\nA flame born of human's ancient yearning, in my hand now brightly burning.\nThe pipe meets fire in a lover’s dance, the smoke does rise in a wispy prance,\nBillowing clouds that gently drift, an offering to the air, a gift.\n\nThey twist and twirl, a smoky specter, the plants around, its willing receptor,\nThe smoke is claimed, absorbed, entwined, a secret pact with flora signed.\nBut as I draw again, a change perceived, the vibrant tableau subtly deceived,\nThe sunlit meadow, once so bright, now tinged with hues of encroaching night.\n\nThe pipe is emptied with a stick's pull, a clearing act that’s strangely cruel,\nThe bowl refilled with field-fresh grass, a darker shade than the previous pass.\nEach draw I take, each smoke exhaled, tells a tale of a field assailed,\nThe chirping chorus begins to wane, the joy of nature's song in strain.\n\nThe onset of cough, subtle at first, a bubble in the stream soon to burst,\nTransitioning to a wheezing gale, the singing birds now silent and frail.\nThe once vibrant field, now dull and meek, a desolate canvas, colorless, bleak,\nThe pipe is empty, no grass remains, a field stripped bare by relentless pains.\n\nIn the end, there's naught but the cough, the rasping echo of a pipe turned off,\nThe field lies empty, the jay is gone, a silence scrubbed more deafening than any song.\nWhat was once a vibrant green, life-filled scene, is now just shades of gray.\nA lesson learned in the smoke’s twist and twine, of how we treat this Earth of mine.\n\n\n![second smoke](/writing/images/second_smoke.png)"
  },
  {
    "post_title": "Siamese",
    "title": "Siamese",
    "preview": "<div align=\"center\">\n\n## Siamese\n\nI see the beauty in\nThe notebooks of others:\nSo organized. I envy the\nMind which is so delicate.\nAnd who’s thoughts do not\nQuiver when performing this\nSurgery of feel...",
    "url": "writing/poems_Siamese",
    "imageSources": [
      "/writing/images/siamese.png"
    ],
    "scripts": [],
    "image": "/writing/images/siamese.png",
    "content": "<div align=\"center\">\n\n## Siamese\n\nI see the beauty in\nThe notebooks of others:\nSo organized. I envy the\nMind which is so delicate.\nAnd who’s thoughts do not\nQuiver when performing this\nSurgery of feeling. But alas\nThis is mine, and he is mine\nAnd so I love him, for\nHe is me, and I am all that\nI have, when you strip me down.\nThere is still a friend. Arrogant,\nBut trapped in here with me.\nOr perhaps I am him, and I am\nShackled here, while he lives.\nBut either way, the thoughts we\nShare are Siamese and of love.\n\n![siamese](/writing/images/siamese.png)"
  },
  {
    "post_title": "Silver Bellies",
    "title": "SilverBellies",
    "preview": "<div align=\"center\">\n\n## Silver Bellies\n\nWhen the river dries, the minnows are like fallen leaves, \nof the red willows silver bellies, and the flies come for feasts,\nAs the land wastes not. But I see ...",
    "url": "writing/poems_SilverBellies",
    "imageSources": [
      "/writing/images/silver-bellies.png"
    ],
    "scripts": [],
    "image": "/writing/images/silver-bellies.png",
    "content": "<div align=\"center\">\n\n## Silver Bellies\n\nWhen the river dries, the minnows are like fallen leaves, \nof the red willows silver bellies, and the flies come for feasts,\nAs the land wastes not. But I see this and know,\nCome autumn when summer ceases to grow,\nI will see the leaves of willows and mourn the minnows.\n\n\n![silver bellies](/writing/images/silver-bellies.png)"
  },
  {
    "post_title": "Trivia",
    "title": "Trivia",
    "preview": "<div align=\"center\">\n\n## Trivia\n\nWednesday is Trivia. Some are there to win, others to laugh, and a few more are busy enjoying their drinks. \nIt’s a swirl of vibrancy: of sounds, shapes, colors, backg...",
    "url": "writing/poems_Trivia",
    "imageSources": [
      "/writing/images/trivia.png"
    ],
    "scripts": [],
    "image": "/writing/images/trivia.png",
    "content": "<div align=\"center\">\n\n## Trivia\n\nWednesday is Trivia. Some are there to win, others to laugh, and a few more are busy enjoying their drinks. \nIt’s a swirl of vibrancy: of sounds, shapes, colors, backgrounds, faces, voices, laughs, clothes, shoes. \nIt feels like life; like being alive. \nI handed a poem to a friend to read. \nHe asked me what it meant, and I tried to explain, but it was gone.\nCrimson mixed away into the colors of evening; the yellows and oranges, the blues and purples and browns. \n\n\n![trivia](/writing/images/trivia.png)"
  },
  {
    "post_title": "Cat",
    "title": "cat_fly",
    "preview": "<div align=\"center\">\n\n## Cat\n\nCat stares outward, a paw draped over the dresser like a hook,\nLazily scooping the air, bailing out the tears sinking her ship.\nShe sees them in the air, the vespers of e...",
    "url": "writing/poems_cat_fly",
    "imageSources": [
      "/writing/images/cat_fly.png",
      "/writing/images/cat.png"
    ],
    "scripts": [],
    "image": "/writing/images/cat_fly.png",
    "content": "<div align=\"center\">\n\n## Cat\n\nCat stares outward, a paw draped over the dresser like a hook,\nLazily scooping the air, bailing out the tears sinking her ship.\nShe sees them in the air, the vespers of energy. Negativity that threatens.\nCat sees them in the air, and paws at them lazily. \nIt’s beneath her,\nAs is most things. \nSo much is beneath her when she drapes over the tall dresser.\nHigh in the air, she can watch for her prey. \nA buzzing in the air. Her hook springs to life.\nThe awful fly, buzzing like a clock. \nCat is angered by the ticking of the fly. \nAs it slams its miserable body of filth into a window. \nOver an over again. The fly is beneath cat too,\nBut it angers her.\nCat swats and the fly spirals down, like a wounded Goose it spirals down.\nExploding into the carpet. \nCat smiles.\nDangling her hook, with one eye open, and one ear perked up.\n\n\n\n![exhausted](/writing/images/cat_fly.png)\n\n\n![exhausted](/writing/images/cat.png)"
  },
  {
    "post_title": "Look a Poem",
    "title": "dont_read",
    "preview": "## Look a Poem\n\nUnder the dim ( I'm just a blur (\nWords all jumbled, a tongue-tied >\n< In the crowd # I'm a ghost, barely =\nCraving a look -- someone to).\n\nMy sentences stumble~~|_ clumsy or frail%%\ns...",
    "url": "writing/poems_dont_read",
    "imageSources": [
      "/writing/images/dont-read.png"
    ],
    "scripts": [],
    "image": "/writing/images/dont-read.png",
    "content": "## Look a Poem\n\nUnder the dim ( I'm just a blur (\nWords all jumbled, a tongue-tied >\n< In the crowd # I'm a ghost, barely =\nCraving a look -- someone to).\n\nMy sentences stumble~~|_ clumsy or frail%%\nso a boat lost in me $?no wind?$ >>10 sails.\nAching for that glance >> to be part of your song.\nIn this world ($) do I even ?\n\nToo shaky ~{ eyes too }~ I'm ; true?\nAll words. no way through too?!?\nAmidst the wise, I'm who?!?\nAll doubt.!.!.\n\n![dont read](/writing/images/dont-read.png)"
  },
  {
    "post_title": "Dust",
    "title": "dust",
    "preview": "# Dust\n\n\nIt seemed so small, looking through the sunlight at the dust,\nThose specs of withered skin, rotten and decomposed.\nFloating like feathers, little angels in the air, until they settle,\nAnd dus...",
    "url": "writing/poems_dust",
    "imageSources": [
      "https://workers-ai.eankrenzin.workers.dev/?key=image-1709187361830.png"
    ],
    "scripts": [],
    "image": "https://workers-ai.eankrenzin.workers.dev/?key=image-1709187361830.png",
    "content": "# Dust\n\n\nIt seemed so small, looking through the sunlight at the dust,\nThose specs of withered skin, rotten and decomposed.\nFloating like feathers, little angels in the air, until they settle,\nAnd dust will always fall, like angels. And then the problems \nRise. Problems, or little demons. Minuscule things that  settled.\nIt’s painful to breathe, when the dust coats your lungs. \nKitty litter spilled from boxes of shit, how gruesome the result,\nSuch a sweet feline, that pussy cat can be, until she sheds.\nHer fur, more dust in the air, beautiful like a feather from a songbird,\nPerhaps from a corpse, lingering within her tummy. \nFeathers are so light, and yet they bear the weight of decay.\nHow heavy that feeling, the decay that settles. And yet!\nA vacuum, or a broom, and soon the wound is spun up into,\nTrash! The trash indeed! The trash is free! How wonderful\nThe feeling is to be clean, the feeling in me, clean as can be!\nBut the dust settles on the broom too, and in the vacuum three! \nWhat’s left but me, to wipe away that grime inside, and suddenly,\nThe dust coats my finger tips, and a demon whispers through sickly lips.\nHow angry I become, that the dust has settled upon me.\nHow angry I should be, don’t you see! It’s on my hands!\nIt’s in my hair! It’s on my skin! It IS MY SKIN! \nHow terrible to know: the dust is me.\n\n![image](https://workers-ai.eankrenzin.workers.dev/?key=image-1709187361830.png)"
  },
  {
    "post_title": "Exhaustion",
    "title": "exhastion_prose",
    "preview": "<div align=\"center\">\n\n## Exhaustion\n\nExhaustion is a nefarious beast. Insidious in that it creeps up on you, when you are most vulnerable. Vulnerable in your pleasure, or effort, that leaves you witho...",
    "url": "writing/poems_exhastion_prose",
    "imageSources": [
      "/writing/images/exhaustion.png"
    ],
    "scripts": [],
    "image": "/writing/images/exhaustion.png",
    "content": "<div align=\"center\">\n\n## Exhaustion\n\nExhaustion is a nefarious beast. Insidious in that it creeps up on you, when you are most vulnerable. Vulnerable in your pleasure, or effort, that leaves you without time for rest. Exhaustion stabs you in the back when you have exerted your entire will, leaving nothing left. Naked on a table Exhaustion dissects you while you are awake. It injects you with tranquilizers to muffle the screams of your zeitgeist, the bleeding of your soul. That is exhaustion. Where the only way to pacify exhaustion is to rest, sacrificing your nascent obligations to the slaughter. A cruel transaction where someone must break. The shattered pieces on the floor are heartbreaking. Each piece with a mind, and an eye. Yet the fragments cannot see themselves, scattered across the floor. They cannot know their own pain. But looking at the fragments, what can you feel but pity.\n\n\n![exhausted](/writing/images/exhaustion.png)\n"
  },
  {
    "post_title": "Personality of numbers",
    "title": "personality_of_numbers",
    "preview": "\n## Personality of numbers\n\n15 - One is the rising sun, or journey begun. Easily but\n15 - true. Boring stories until two shows struggle ensued. Numbers \n15 - decree personality! Do you see she said to...",
    "url": "writing/poems_personality_of_numbers",
    "imageSources": [
      "https://workers-ai.eankrenzin.workers.dev/?key=image-1702599883908.png"
    ],
    "scripts": [],
    "image": "https://workers-ai.eankrenzin.workers.dev/?key=image-1702599883908.png",
    "content": "\n## Personality of numbers\n\n15 - One is the rising sun, or journey begun. Easily but\n15 - true. Boring stories until two shows struggle ensued. Numbers \n15 - decree personality! Do you see she said to me? Three\n15 - has a lore to explore. But four is a dangerous encore:\n15 - Will it survive to thrive inside of the hive that becomes five?\n15 - Six will mix pain killing solution, fixing, mixing. Then risking: \n15 - injecting seven to feel heaven. Seven is gambling the\n15 - fate of eight - good luck trying to resuscitate from that state.\n15 - Nine, prim, always on time, proper and in line, a perfect rhyme.\n10 - Then, stuffy and round, my friend ten is the end.\n\n![cover](https://workers-ai.eankrenzin.workers.dev/?key=image-1702599883908.png)"
  },
  {
    "post_title": "The Silence of Indifference",
    "title": "silence_of_indifference",
    "preview": "## The Silence of Indifference\n\n2023-12-07\n\n\nIn the realm of shadowed thoughts, where whispers fade, Dwells Self, aloof, in indifference's shade. Its gaze, though distant, cuts sharper than steel, Ign...",
    "url": "writing/poems_silence_of_indifference",
    "imageSources": [
      "https://workers-ai.eankrenzin.workers.dev/?key=image-1702008523288.png"
    ],
    "scripts": [],
    "image": "https://workers-ai.eankrenzin.workers.dev/?key=image-1702008523288.png",
    "content": "## The Silence of Indifference\n\n2023-12-07\n\n\nIn the realm of shadowed thoughts, where whispers fade, Dwells Self, aloof, in indifference's shade. Its gaze, though distant, cuts sharper than steel, Ignoring Other, whose existence it won't feel.\n\nThrough halls of neglect, the cold silence spreads, As Self walks unheeding, where empathy treads. Indifference, the weapon, more cruel than a blade, Leaving Other in darkness, unseen and unswayed.\n\nOther, the forgotten, in the void of neglect, Bears the invisible scars, the pain of defect. Unseen, unheard, in the silence they scream, A ghost in the world of Self's indifferent dream.\n\nEach step Self takes, blind to the cries, Carves deeper the chasm where Other hopes to die. A void of attention, a desert of care, Where Other's pleas vanish in the uncaring air.\n\nIn this dance of neglect, where attention never pairs, Self and Other, trapped in unspoken affairs. The pain of indifference, a silent, ruthless storm, In this world of neglect, where coldness is the norm.\n\nSelf, the ignorer, with eyes that never see, Leaves trails of pain in its apathy. A master of silence, with each turn so deft, Echoing loudly in the spaces Other has left.\n\nOther, the invisible, with wounds that never bleed, Suffers in silence, their existence a seed In the barren soil of Self's indifferent land, Where no acknowledgment grows, no understanding hand.\n\nIn this twisted waltz, where silence intertwines, Self and Other, in fate's cruel designs. The ignored and the ignorer, one and the same, In this masquerade of silence, a heartless game.\n\nThe revelation dawns, in this world so stark, The pain of being unseen, a mark. The true agony lies in the indifferent breath, Of Self, who renders Other as good as death.\n\nIn the realm of the ignored, where silent echoes trace, Lies the most painful wound, an empty space. Where Self's indifference cuts deeper than any knife, Leaving Other to wither, unseen in life.\n\n![surgeon](https://workers-ai.eankrenzin.workers.dev/?key=image-1702008523288.png)"
  },
  {
    "post_title": "Spring Breeze",
    "title": "spring_breeze",
    "preview": "# Spring Breeze\n\nThe spring breeze blows blue, teal into green and the smell is of sweat,\nPheromones of the earth, the musky wet of mildew. Dirt. \nThe breeze dances through my window, dappling droplet...",
    "url": "writing/poems_spring_breeze",
    "imageSources": [
      "https://workers-ai.eankrenzin.workers.dev/?key=image-1709323629019.png"
    ],
    "scripts": [],
    "image": "https://workers-ai.eankrenzin.workers.dev/?key=image-1709323629019.png",
    "content": "# Spring Breeze\n\nThe spring breeze blows blue, teal into green and the smell is of sweat,\nPheromones of the earth, the musky wet of mildew. Dirt. \nThe breeze dances through my window, dappling droplets of dew.\nThe breeze caresses my cheeks, canoodling and carefree, scandalous.\nThe smell, so sweet, supple, sugary ambrosia, tickling my nose.\n\nI freeze to peruse:\nPrimordial, born of the titans, the breeze frolicked like man,\nDancing born not of Aphrodite nor Hera, not woman alone. \nEos, the dawn, and Astraeus the dusk. Joined by sons.\nAh the mystery of history.\n\nThe air in lungs howling against the mountain, \nas swift feet carry up and down the trails.\nOver verdant hills and past the burgeoning river.\nDeeper blue than Neptune, when the ivory of snow melts.\nSo much force, behind that breeze, rippling cloth to sails.\nPushing forward, carrying song and feather.\n\nDawn sun between breaths as I wake from dream.\nGentle, but exhilarating too. The spring dawn, so full of life.\nAnd  dusk sun sets, but slowly, peacefully guiding the souls to rest.\nYet the spring breeze is between, in moments of lust and love.\n\n![breeze](https://workers-ai.eankrenzin.workers.dev/?key=image-1709323629019.png)"
  },
  {
    "post_title": "Their Run",
    "title": "their_run",
    "preview": "<div align=center>\n\n## Their Run\n\n7-1-2023\n\n\nOn our trail I run faster than him,\nWhen I turn, he smiles back at me,\nMy running partner.\nA sign marks the middle, our meeting point.\n“No trespassing”\nBut...",
    "url": "writing/poems_their_run",
    "imageSources": [],
    "scripts": [],
    "content": "<div align=center>\n\n## Their Run\n\n7-1-2023\n\n\nOn our trail I run faster than him,\nWhen I turn, he smiles back at me,\nMy running partner.\nA sign marks the middle, our meeting point.\n“No trespassing”\nBut we run anyways. Nothing stops us.\n\nThe sign is at the top of the hill.\nHe’s coming down, I’m running up to him.\nWhen we meet, he spreads his arms,\nAnd embraces me. It’s a moment of pause.\nAnd then I run past, And he’s behind me.\n\nNow every time I run up the hill,\nI yearn for his embrace.\nI changed the route, \nThere is no more trespassing sign,\nBut I can’t get around that hill,\nIt’s always there, so I’m always looking for him.\n\nWe never used to stop on the trail,\nBut now I pause halfway. I look at the trees,\nI hear the birds, their song,\nIt’s beautiful. But we used to laugh\nMy laugh was so loud, the birds would pause,\nBut now I pause and listen to them.\n\n"
  },
  {
    "post_title": "Turkey",
    "title": "turkey",
    "preview": "<div align=\"center\">\n\n## Turkey\n\nThe early bird gets the worm,\nbut the fattest turkey becomes dinner.\n\n...",
    "url": "writing/poems_turkey",
    "imageSources": [
      "/writing/images/turkey.png"
    ],
    "scripts": [],
    "image": "/writing/images/turkey.png",
    "content": "<div align=\"center\">\n\n## Turkey\n\nThe early bird gets the worm,\nbut the fattest turkey becomes dinner.\n\n![turkey](/writing/images/turkey.png)"
  },
  {
    "post_title": "Unanswered",
    "title": "unanswered",
    "preview": "## Unanswered\n\nDate: 12-03-2023\n\nThe phone rings, my muscles tense in anticipation\nsore from the day before, I stretch. Yawning, but I\nam not tired. The phone rings. I sigh, knowingly.\nI'm calling a c...",
    "url": "writing/poems_unanswered",
    "imageSources": [],
    "scripts": [],
    "content": "## Unanswered\n\nDate: 12-03-2023\n\nThe phone rings, my muscles tense in anticipation\nsore from the day before, I stretch. Yawning, but I\nam not tired. The phone rings. I sigh, knowingly.\nI'm calling a cellphone, a flip phone, one that you could not\ncatch me dead with. My Grandmas new phone.\nThe phone rings. At this point it is clear that there will not be an answer.\nI think about how eventually there will never be an answer.\nThis time it's temporary, but everything is temporary until it's not.\nThat comes up a lot at work, solutions to complete a job,\nbut not to do it well. I wanted to tell her about my week. \nIt was a long one.\nShe has dementia, or Alzheimer's. Really she just has old age.\nIt's therapeutic to tell someone who you know will forget what you've said.\nIn a way, it's inspiring because it shows clearly what matters.\nIn the end, that hard week really did not matter, and when she forgets\nI forget too, a bit.\nI wonder how long I will remember her. I know it's forever,\nbut death becomes a fog. Will I remember the way she asked about school,\nor how she tells me that she is doing a whole bunch of nothing?\nThe texture of her skin, which I have watched deepen.\nWhat version of hair? Will I remember the years she went to get a perm, or instead\nthe coarser, straight, hair that she has now. Perhaps the hair I first met?\nMore likely, whatever photo of her I see the most.\nAnd that's what life after death seems to be.\nPhotos and memories.\nGrandma is a wrench in my plans to forget every day.\nShe is a moment I can't forget, and don't want to.\nI worry though, that the floodgates are open without a filter.\nLife is hard, and remembering it all would kill me.\nSo perhaps I can choose to remember one thing.\nOne thing alone, which is that she was here for me.\nAnd perhaps this time she did not answer, but so many other times she did.\nThat was enough, and always will be. I'm so grateful that she answered, every week, for years.\n\n"
  },
  {
    "post_title": "wind chimes",
    "title": "windchimes",
    "preview": "# wind chimes\n\nWrangling the nail onto the tree,\nRing and Thump. Ring and Thump.\nThe hammer hits the nail on the head\n\nAnd then it’s there, a nail in a tree,\nA sliver of metal, silver like a scar,\nBut...",
    "url": "writing/poems_windchimes",
    "imageSources": [
      "https://workers-ai.eankrenzin.workers.dev/?key=image-1709324545840.png"
    ],
    "scripts": [],
    "image": "https://workers-ai.eankrenzin.workers.dev/?key=image-1709324545840.png",
    "content": "# wind chimes\n\nWrangling the nail onto the tree,\nRing and Thump. Ring and Thump.\nThe hammer hits the nail on the head\n\nAnd then it’s there, a nail in a tree,\nA sliver of metal, silver like a scar,\nBut meaningful as a tattoo, Taboo too.\n\nWrap the little string around that nail,\nAnd the wind chimes go up,\nFor their final resting place.\n\nHung.\n\n![lines](https://workers-ai.eankrenzin.workers.dev/?key=image-1709324545840.png)"
  }
]